tutorials/twoPhaseStratifiedFlow/meshA/constant/freeSurfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      surfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceType    freeSurface;

twoFluids no;
cleanInterface yes;
surfaceTension surfaceTension [ 1 -2 0 0 0 0 0 ] 100.0;
fixedFreeSurfacePatches 0();
nFreeSurfaceCorrectors 1;//1;





normalMotionDir yes;

motionDir (0 1 0);

muFluidA muFluidA [ 1 -1 -1 0 0 0 0 ] 0.01;

muFluidB muFluidB [ 1 -1 -1 0 0 0 0 ] 0.00001;

rhoFluidA rhoFluidA [ 1 -3  0 0 0 0 0 ] 1.0;

rhoFluidB rhoFluidB [ 1 -3  0 0 0 0 0 ] 0.001;

cleanSurfaceTension cleanSurfaceTension [ 1 0 -2 0 0 0 0 ] 100.0;

g g [ 0 1 -2 0 0 0 0 ] ( 0 0 0);

fixedSurfacePatches 0();

pointNormalsCorrectionPatches 0( );

nSurfaceCorrectors 3;//1;

smoothing off;

// ************************************************************************* //
