tutorials/twoPhaseStratifiedFlow/meshA/constant/speciesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      speciesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
reactionType "noReaction";

referenceLength refLength [0 1 0 0 0 0 0] 0.002; //diameter of bubble

applySGSmodel      true;
sgsDiffusionAtSigmaCorr true;
sgsDiffusionFacesCorr   true;
sgsAdvectionCorr        true;
sgsDiffusionFacesCorr_P   false;
sgsAdvectionCorr_P        false;
blendAdvection true;
blendDiffBulk true;
blendDiffSig true;

alphaAdv alphaAdv [0 0 0 0 0 0 0] 2.0;
alphaDiff alphaDiff [0 0 0 0 0 0 0] 2.0;
alphaDiffSigma alphaDiffSigma [0 0 0 0 0 0 0] 2.0;

// ************************************************************************* //
